DataProcessors/бит_ПроверкаДатыПоверки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>бит_ПроверкаДатыПоверки</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаПоказанийПодкрутки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Счетчики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВладелецСчетчика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
								<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПоверки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Здание</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Квартира</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_Квартиры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Счетчик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_Счетчики</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Улица</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_СписокУлиц</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТаблицаЗаполнения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВладелецСчетчика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
								<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПоверки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Счетчик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_Счетчики</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Enums/бит_ВидыОперацийУстановкаСчетчика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>бит_ВидыОперацийУстановкаСчетчика</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>УстановкаСчетчика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДобавитьЛицевыеСчетаНаСчетчик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьЛицевыеСчетаСоСчетчика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СнятиеСчетчика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УстановкаСчетчикаНаДома</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СнятиеСчетчикаСДомов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеСведенийПоСчетчику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДобавитьУслугиНаСчетчик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьУслугиСоСчетчика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДобавитьЗданияНаСчетчик</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/бит_ТипСчетчика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>бит_ТипСчетчика</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Групповой</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Индивидуальный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/бит_ВидыОперацииИзменениеДатыПоверки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>бит_ВидыОперацииИзменениеДатыПоверки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>УстановкаДатыПоверки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СнятьДатуПоверки</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/бит_ВидыОперацииВводПоказанийПоСчетчикам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>бит_ВидыОперацииВводПоказанийПоСчетчикам</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВводПоказаний</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоказанияПодкрутки</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/бит_УстановкаСчетчика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>бит_УстановкаСчетчика</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.бит_СведенияПоУслугамЛС</xr:Item>
				<xr:Item>AccumulationRegister.бит_ПоказанияСчетчиков</xr:Item>
				<xr:Item>InformationRegister.бит_ПоверкаСчетчиков</xr:Item>
				<xr:Item>InformationRegister.бит_ГрупповыеСчетчики</xr:Item>
				<xr:Item>InformationRegister.бит_СчетчикиНаУслугахОбщий</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВведеныРазовые</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыОперацийУстановкаСчетчика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоверки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьПравилоУменьшения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьСтавкуПоСчетчику</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонечныеПоказания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоУстановкиСчетчика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Комнаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Многотарифный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачальныеПоказания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
						<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодборРазныеЗдания</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Comment>Приоритет общедомового счетчика</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокЛицевыхСчетов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособРасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_СпособыРасчетаПоУслугам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Счетчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Счетчики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетчикСЗависимымиУслугами</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>лб_УстановкаСчетчикаНаДомБезЛС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КонечныеПоказания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачальныеПоказания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОсновнаяУслуга</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поставщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ПоставщикиУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РежимПотребления</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_РежимыПотребленияУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособРаспределения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.бит_СпособыРаспределения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособРаспределенияУменьшения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.бит_СпособыРаспределения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособРасчетаУменьшения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.бит_СпособыРасчетаПоУслугам</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусКвартиры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_СтатусыКвартиры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипКвартиры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ТипыКвартиры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьСпособРасчета</Name>
							<Type>
								<v8:Type>cfg:EnumRef.бит_СпособыРасчетаПоУслугам</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЛицевыеСчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Адрес</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>120</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Здание</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Индивидуальный</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЛицевойСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтветственноеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПорядковыйНомерСчетчикаПоУслуге</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>15</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УстановленныйСчетчик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_Счетчики</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/бит_ПроверкаДатыПоверки/Forms/ФормаУправляемая/Ext/Form/Module.bsl
#Область ПеременныеМодуля

&НаКлиенте 
Перем мКэшРеквизитовФормы;       // Хранит текущие значения реквизитов формы. Клиент.

#КонецОбласти

#Область РаботаСКэшемРеквизитовФормы

// Процедура заполняет кэш реквизитов формы данными объекта.
//
// Параметры:
//  Нет.
//
&НаКлиенте 
Процедура ЗаполнитьТекущиеЗначенияРеквизитовФормы()
	
	Для Каждого КлючИЗначение Из мКэшРеквизитовФормы Цикл
		
		мКэшРеквизитовФормы[КлючИЗначение.Ключ] = Объект[КлючИЗначение.Ключ];
		
	КонецЦикла; 
	
КонецПроцедуры // ЗаполнитьТекущиеЗначенияРеквизитовФормы()

#КонецОбласти

#Область ПроцедурыИФункцииУправленияВнешнимВидомФорм

// Процедура осуществляет управление доступностью/видимостью элементов формы.
//
// Параметры:
//  Нет.
//
&НаСервере 
Процедура УправлениеЭлементамиФормы()
	
	Текст = Элементы.Декорация1.Заголовок + ": "+ Формат(ТекущаяДата(), "ДЛФ=DD");
	Элементы.Декорация1.Заголовок = Текст;	
	
КонецПроцедуры // УправлениеЭлементамиФормы()

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ЗаполнитьИзМодуляОбычногоПриложения") Тогда
		
		Результат = Параметры.ЗаполнитьИзМодуляОбычногоПриложения.Результат;
		
		Объект.Счетчики.Загрузить(Результат);
		
	КонецЕсли;
	
	Объект.ДатаПоказанийПодкрутки = КонецДня(КонецМесяца(ТекущаяДата())) - 30;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Зададим имена реквизитов, подлежащих кешированию.
	мКэшРеквизитовФормы = Новый Структура;
	
	// Запомним текущие значения реквизитов формы.
	ЗаполнитьТекущиеЗначенияРеквизитовФормы();
	
	УправлениеЭлементамиФормы();
	
	// БИТ ЖКХ 09.04.2021
	ЭтаФорма.Элементы.СчетчикиВводПоказанийПодкрутки.Доступность = ложь;
КонецПроцедуры

#КонецОбласти

#Область ДействияКомандФормы

&НаКлиенте
Процедура Заполнить(Команда)
	
	ВыполнитьПроверкуНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьСчетчик(Команда)
	
	Если Объект.Счетчики.Количество() = 0 Тогда
		
		Возврат;
		
	КонецЕсли; 
	
	ТекСтрока = Элементы.Счетчики.ТекущиеДанные;
	
	Если ТекСтрока <> Неопределено Тогда
		
		ПараметрыФормы = Новый Структура;
		
		ПараметрыФормы.Вставить("ВидОперации", ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийУстановкаСчетчика.СнятиеСчетчика"));
		
		// БИТ_ЖКХ 04.06.2014
		ТекСтрокаСчетчикТипСчетчика = ТипСчетчикаНаСервере(ТекСтрока.Счетчик);
		
		Если ТекСтрокаСчетчикТипСчетчика = ПредопределенноеЗначение("Перечисление.бит_ТипСчетчика.Групповой") Тогда
			// БИТ_ЖКХ 04.06.2014
			
			ПараметрыФормы.Вставить("Объект");
		Иначе
			ПараметрыФормы.Вставить("Объект"     , ТекСтрока.ВладелецСчетчика);
		КонецЕсли; 
		
		ПараметрыФормы.Вставить("Дата"       , ТекущаяДата());
		ПараметрыФормы.Вставить("Счетчик"    , ТекСтрока.Счетчик);
		
		ОткрытьФорму("Документ.бит_УстановкаСчетчика.Форма.ФормаДокументаУправляемая", Новый Структура("ЗаполнитьИзОбработкиПоверки", ПараметрыФормы), ЭтаФорма);
		
	Иначе

		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Укажите строку содержащую счетчик для снятия.");
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДатуПоверки(Команда)
	
	Если Объект.Счетчики.Количество() = 0 Тогда
		
		Возврат;
		
	КонецЕсли; 
	
	ПараметрыФормы = Новый Структура;
	
	ПараметрыФормы.Вставить("ВидОперации", ПредопределенноеЗначение("Перечисление.бит_ВидыОперацииИзменениеДатыПоверки.УстановкаДатыПоверки"));
	ПараметрыФормы.Вставить("Дата"       , ТекущаяДата());
	
	Ответ = Неопределено;
	
	ПоказатьВопрос(Новый ОписаниеОповещения("УстановитьДатуПоверкиЗавершение", ЭтотОбъект, Новый Структура("ПараметрыФормы", ПараметрыФормы)), "Заполнить документ на основании таблицы ""Счетчики""?", РежимДиалогаВопрос.ДаНетОтмена); 
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДатуПоверкиЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	ПараметрыФормы = ДополнительныеПараметры.ПараметрыФормы;
	
	Ответ = РезультатВопроса; 
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		
		МассивСчетчиков = ПолучитьМассивСчетчиковНаСервере();
		
		ПараметрыФормы.Вставить("МассивСчетчиков", МассивСчетчиков);
		
		ОткрытьФорму("Документ.бит_ИзменениеДатыПоверки.Форма.ФормаДокументаУправляемая", Новый Структура("ЗаполнитьИзОбработкиПоверки", ПараметрыФормы), ЭтаФорма);
		
	ИначеЕсли Ответ = КодВозвратаДиалога.Нет Тогда
		
		ПараметрыФормы.Вставить("МассивСчетчиков", Неопределено);
		
		ОткрытьФорму("Документ.бит_ИзменениеДатыПоверки.Форма.ФормаДокументаУправляемая", Новый Структура("ЗаполнитьИзОбработкиПоверки", ПараметрыФормы), ЭтаФорма);
		
	ИначеЕсли Ответ = КодВозвратаДиалога.Отмена Тогда
		
		Возврат;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьДатуПоверки(Команда)
	
	Если Объект.Счетчики.Количество() = 0 Тогда
		
		Возврат;
		
	КонецЕсли; 
	
	ПараметрыФормы = Новый Структура;
	
	ПараметрыФормы.Вставить("ВидОперации", ПредопределенноеЗначение("Перечисление.бит_ВидыОперацииИзменениеДатыПоверки.СнятьДатуПоверки"));
	ПараметрыФормы.Вставить("Дата"       , ТекущаяДата());
	
	Ответ = Неопределено;
	
	ПоказатьВопрос(Новый ОписаниеОповещения("СнятьДатуПоверкиЗавершение", ЭтотОбъект, Новый Структура("ПараметрыФормы", ПараметрыФормы)), "Заполнить документ на основании таблицы ""Счетчики""?", РежимДиалогаВопрос.ДаНетОтмена);
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьДатуПоверкиЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	ПараметрыФормы = ДополнительныеПараметры.ПараметрыФормы;
	
	Ответ = РезультатВопроса; 
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		
		МассивСчетчиков = ПолучитьМассивСчетчиковНаСервере();
		
		ПараметрыФормы.Вставить("МассивСчетчиков", МассивСчетчиков);
		
		ОткрытьФорму("Документ.бит_ИзменениеДатыПоверки.Форма.ФормаДокументаУправляемая", Новый Структура("ЗаполнитьИзОбработкиПоверки", ПараметрыФормы), ЭтаФорма);
		
	ИначеЕсли Ответ = КодВозвратаДиалога.Нет Тогда
		
		ПараметрыФормы.Вставить("МассивСчетчиков", Неопределено);
		
		ОткрытьФорму("Документ.бит_ИзменениеДатыПоверки.Форма.ФормаДокументаУправляемая", Новый Структура("ЗаполнитьИзОбработкиПоверки", ПараметрыФормы), ЭтаФорма);
		
	ИначеЕсли Ответ = КодВозвратаДиалога.Отмена Тогда
		
		Возврат;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

&НаСервере
Процедура ВыполнитьПроверкуНаСервере()
	
	ОбработкаОбъект = ДанныеФормыВЗначение(Объект, Тип("ОбработкаОбъект.бит_ПроверкаДатыПоверки"));
	ОбработкаОбъект.ВыполнитьПроверку();
	
	ЗначениеВДанныеФормы(ОбработкаОбъект, Объект);
	
	// БИТ ЖКХ 09.04.2021
	если Объект.Счетчики.Количество() > 0 тогда
	 ЭтаФорма.Элементы.СчетчикиВводПоказанийПодкрутки.Доступность = истина;	
	иначе
	 ЭтаФорма.Элементы.СчетчикиВводПоказанийПодкрутки.Доступность = ложь;	
	конецесли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьМассивСчетчиковНаСервере()
	
	ТаблицаЗначений = Новый ТаблицаЗначений;
	ТаблицаЗначений.Колонки.Добавить("Счетчик");
	ТаблицаЗначений.Колонки.Добавить("ДатаПоверки");
	ТаблицаЗначений.Колонки.Добавить("ВладелецСчетчика");
	ТаблицаЗначений.Колонки.Добавить("Улица");
	ТаблицаЗначений.Колонки.Добавить("Здание");
	ТаблицаЗначений.Колонки.Добавить("Квартира");
	ТаблицаЗначений.Колонки.Добавить("НоваяДатаПоверки");
	
	Для каждого Строка Из Объект.Счетчики Цикл
		
		НоваяСтрока = ТаблицаЗначений.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		
		НоваяСтрока.НоваяДатаПоверки = Строка.ДатаПоверки;
		
	КонецЦикла;
	
	МассивСчетчиков = бит_ОбщегоНазначения.ТаблицаЗначенийВМассив(ТаблицаЗначений);
	
	Возврат МассивСчетчиков;
	
КонецФункции

// БИТ_ЖКХ 04.06.2014
&НаСервере
Функция ТипСчетчикаНаСервере(Счетчик)
	
	Возврат Счетчик.ТипСчетчика;	
	
КонецФункции	

// БИТ_ЖКХ 13.04.2021
&НаКлиенте
Процедура ВводПоказанийПодкрутки(Команда)
	ВводПоказанийПодкруткиНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВводПоказанийПодкруткиНаСервере()
	
	    ДокументВводПоказаний = Документы.бит_ВводПоказанийПоСчетчикам.СоздатьДокумент();
		
		ДокументВводПоказаний.Дата        = Объект.ДатаПоказанийПодкрутки;
		ДокументВводПоказаний.Организация = Объект.Счетчики[0].ВладелецСчетчика.Организация;
		ДокументВводПоказаний.ВидОперации = Перечисления.бит_ВидыОперацииВводПоказанийПоСчетчикам.ПоказанияПодкрутки;
		ДокументВводПоказаний.ТипСчетчика = Перечисления.бит_ТипСчетчика.Индивидуальный;
		ДокументВводПоказаний.Комментарий = "Документ создан автоматически при поверке счетчиков " + Формат(ДокументВводПоказаний.Дата, "ДФ='ММММ гггг'");
		ДокументВводПоказаний.Ответственный = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь");
		
		
		СписокСчетчиков = Объект.Счетчики.Выгрузить().ВыгрузитьКолонку("Счетчик");
		ДокументВводПоказаний.ЗаполнитьТаблицуПоказанийПоСпискуСчетчиков(СписокСчетчиков);		
		// БИТ_ЖКХ 25.07.2014
		// Если ДокументВводПоказаний.ПоказанияПоСчетчикам.Количество() > 1 Тогда.
		Если ДокументВводПоказаний.ПоказанияПоСчетчикам.Количество() > 0 Тогда
			// БИТ_ЖКХ 25.07.2014
			
			Попытка
				
				ДокументВводПоказаний.Записать(РежимЗаписиДокумента.Проведение);
				
			Исключение
			КонецПопытки;
			
		КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СчетчикиПриИзменении(Элемент)
	
	// БИТ ЖКХ 09.04.2021
	если Объект.Счетчики.Количество() > 0 тогда
	 ЭтаФорма.Элементы.СчетчикиВводПоказанийПодкрутки.Доступность = истина;	
	иначе
	 ЭтаФорма.Элементы.СчетчикиВводПоказанийПодкрутки.Доступность = ложь;	
	конецесли;

КонецПроцедуры
// БИТ_ЖКХ 04.06.2014

#КонецОбласти
